src/cf/DataProcessors/ЗагрузкаКурсовБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаКурсовБумаг</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/Enums/ТипыПериода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыПериода</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОднаМинута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПятьМинут</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПятнадцатьМинут</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТридцатьМинут</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдинЧас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдинДень</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/DataProcessors/ЗагрузкаКурсовБумаг/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗагрузитьДанныеПоЦеннымБумагам(Команда)   
    ОтветСервера = "Пустой ответ";
    
    СтрокаЗапроса = "http://mdata.ux.ua/qdata.aspx?code=" + ПолучитьКодЦеннойБумаги(Инструмент) + "&pb=" + Формат(ДатаНачала, "ДФ=ddMMyyyy") 
        + "&pe=" + Формат(ДатаОкончания, "ДФ=ddMMyyyy") + "&p=" + ПолучитьТипВыборки(ТипВыборки) + "&mk=1&ext=1&sep=2&div=2&df=5&tf=2&ih=1";
        
    СтрокаЗапроса = "http://mdata.ux.ua/qdata.aspx?code=BAVL&pb=01062017&pe=13082017&p=1440&mk=1&ext=1&sep=2&div=2&df=5&tf=2&ih=1";    
    СтруктураВызова = ПомошникИнтеграциииHTTPСервисовКлиентСервер.СтруктураURI(СтрокаЗапроса);
    Попытка
        Соединение = Новый HTTPСоединение(СтруктураВызова.Хост,,,,,600);
        HTTPЗапрос = Новый HTTPЗапрос(СтруктураВызова.ПутьНаСервере);
        //Результат = Соединение.Получить(HTTPЗапрос);
        Результат = Соединение.ВызватьHTTPМетод("GET", HTTPЗапрос);
        ПомошникИнтеграциииHTTPСервисовКлиентСервер.ОбработатьОшибкиРезультатаВызова(Результат);
        ОтветСервера = Результат.ПолучитьТелоКакСтроку();
    Исключение
        Сообщить(ОписаниеОшибки());
        Возврат;
    КонецПопытки;   
    Сообщить(ОтветСервера);
    	
    //ФайлОтвета = Новый Файл(ИмяФайлаОтвета);    
    //Если ФайлОтвета.Существует() Тогда             
    //    ТекстОтвета = Новый ТекстовыйДокумент();
    //    ТекстОтвета.Прочитать(ИмяФайлаОтвета);        
    //    Если ТекстОтвета.КоличествоСтрок()>0 Тогда            
    //        ОтветСервера = ТекстОтвета.ПолучитьТекст();            
    //    Иначе            
    //        СтрокаСообщенияПользователю = СтрокаСообщенияПользователю + Символы.ПС + "Получение данных с сервера: Получен пустой ответ сервера.";        
    //    КонецЕсли;
    //Иначе       
    //    СтрокаСообщенияПользователю = СтрокаСообщенияПользователю + Символы.ПС + "Получение данных с сервера: Ответ сервера не получен.";
    //КонецЕсли;
    //
    ////Читаем cookies и формируем из них строку, которая будет в дальнейшем передаваться на сайт
    //КукиИмя            = СтрПолучитьСтроку(ОтветСервера, 2);
    //КукиЗначение       = СтрПолучитьСтроку(ОтветСервера, 3);
    //ЗаголовкиЗапросов = "Cookie: " + КукиИмя + "=" + КукиЗначение;
    //
    ////создаем еще один временный файл, туда будут помещены данные, переданные сайтом
    //ИмяФайлаОтвета = ПолучитьИмяВременногоФайла();
    //
    //// Запрашиваем данные, передаем параметры запроса и строку с cookies
    //Попытка
    //    
    //    Соединение.Получить(СтрокаЗапроса, ИмяФайлаОтвета, СокрЛП(ЗаголовкиЗапросов)); //ответ сайта записан во временный файл
    //    
    //Исключение
    //    
    //    Сообщить ("Ошибка при получении файла обмена");
    //    
    //КонецПопытки;
    
КонецПроцедуры

&НаСервере
Функция ПолучитьКодЦеннойБумаги(Инструмент)
    
    Возврат СокрЛП(Инструмент.Код);	
    
КонецФункции // ПолучитьКодЦеннойБумаги(Инструмент)

&НаСервере
Функция ПолучитьТипВыборки(ТипВыборки)
    
    Если ТипВыборки = Перечисления.ТипыПериода.ОднаМинута Тогда
        Возврат "1";    
    ИначеЕсли ТипВыборки = Перечисления.ТипыПериода.ПятьМинут Тогда
        Возврат "5";
    ИначеЕсли ТипВыборки = Перечисления.ТипыПериода.ПятнадцатьМинут Тогда
        Возврат "15";
    ИначеЕсли ТипВыборки = Перечисления.ТипыПериода.ТридцатьМинут Тогда
        Возврат "30";
    ИначеЕсли ТипВыборки = Перечисления.ТипыПериода.ОдинЧас Тогда
        Возврат "60";
    ИначеЕсли ТипВыборки = Перечисления.ТипыПериода.ОдинДень Тогда
        Возврат "1440";
    КонецЕсли;
    
КонецФункции //ПолучитьТипВыборки (ТипВыборки)

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    ДатаОкончания = ТекущаяДата();
    ДатаНачала = НачалоМесяца(ДатаОкончания);
    ТипВыборки = Перечисления.ТипыПериода.ОдинДень;
КонецПроцедуры
